[
  {    "title": "The Return of the Monkeys",
    "date": "2025-07-10",
    "content": "The Monkeys are off on their big adventure to Australia tomorrow. </br></br> Mum and the Monkeys are flying to Singapore first, then on to Melbourne. </br></br> I will be left at home for 6 weeks all on my own. </br></br> I wonder what adventures they will have? </br></br> I hope they have a great time and take lots of pictures to share with me.</br></br> This is a blog of me counting down the days till the Monkeys Return home to me."
  },
  {    "title": "The Countdown Begins",
    "date": "2025-07-11",
    "content": ""
  },
  {
    "title": "Summer 2025 - The Adventure Begins!!",
    "date": "2025-07-11",
    "content": "I've just dropped off Mum and the Monkeys at the airport. Waved + hugged them goodbye at Airport Security and now my adventure begins!!. </br></br> Will I survive for 6 weeks all on my own?? </br> What sort of adventures will I have? </br></br> I guess we will see..."
  },
  {
    "title": "First Day Without the Monkeys",
    "date": "2025-07-12",
    "content": "Woke up early expecting one of the Monkeys to come in for a cuddle.  Then I reliased I was all on my own :( </br></br> The Monkeys were probably still a few hours away from landing in Singapore. I missed them but they were off on their own adventure. </br></br>I used all my chef skills opening a packet of oat cakes for breakfast, then I went for a walk in Rushmere Woods. </br> </br> I walked up to the balance logs, counting logs, big chair and climbed on the spider before walking home.  </br></br> After that I went into town, did some clouring at the library. It wasn't as much fun doing that on my own, so I went to get my haircut and got a 2x sasuage rolls (1x Black Pudding, 1x Firecracker) and a free coffee. </br></br> With my energy levels recharged, I had the power I needed to water Granny's garden and do a little bit of weeding for her. </br> </br> Now that the green bin was full. Granny rewarded me for doing her gardening she made me a Granny Ham and Mustard Sandwhich. Yummy!! </br></br>  Back home now as have lots of work todo for Monday. I've not made any plans for rest of the weekend.. but who knows what might happen next? "
  },
    {
    "title": "Day 2 - Home Alone",
    "date": "2025-07-13",
    "content": "No cuddles again!! :( </br></br> But I got a message to say the Monkeys were now safe in Austrialia and had checked into their hotel after their long plane trip.  In the message from Mum she said they were all well behaved on the plane.  </br></br>I wonder what the movies and games were like on the plane?  </br></br>They must have been good if the Monkeys were well behaved for the whole trip??  </br></br>I was more adventurous for breakfast today. I didn't have any pastries like we normally do on a Sunday. So, instead I had toast and the left over cheese and chorizo the monkeys left me in the fridge.  I got dressed, I did some work, took the bins out, watched some TV and watered our garden.  </br></br>With the monkeys being away I got to eat the raspberries. They were tasty. I checked out the sunflowers when I watered them. </br></br>Still only one yellow flower, but the other two look like they will flower soon. </br></br>I wonder what colours they will be? </br><br><img src='./images/sunflowers.jpeg' alt='Sunflowers' class='blog-image'>"
  },
  {
    "title": "Day 3 - Back to Work",
    "date": "2025-07-14",
    "content": "I went into London today. I met Gareth on the train. He told me they went to Buzzstock Music festival and danced in the Sunshine. Sounded fun, but too hot for me to be dancing about in the Sunshine.  It has been 30 degrees for the last few days. Probably hotter than Austrailia?  Thankfully the office has air conditioning so it was nice and cool sitting at my desk. I had a busy day at work, with lots of long phone calls :( but it was someone's birthday and they brought in chocolate cake for us to share. So that was a nice treat. </br> </br>Afterwork I went to Granny's for my dinner. She cooked me pasta with pesto and I had some of Scott's ice cream.  </br></br>I wonder what my Monkeys have been doing in Austraila?? </br></br> Have they had any Austrailia food yet to tell me about?"
  },
  {
    "title": "Day 4 - Train Delays",
    "date": "2025-07-15",
    "content": "In London again today, didn't meet anyone interesting on the train but we did get stuck behind a slow train. So we were late getting into the station.  At the station there was a man giving out free samples of sweets.  They looked like maltesers but had a chewing middle.  I prefer malteasers.  </br></br>Nothing much going on at work today so I spent some time improving the Maths robot so that the Monkeys can practice while they are away. I am a bit worried that they might actually start to beat me soon. </br></br> I miss them :( </br></br> I can't wait to hear about their adventures in Oz."
  },
  {
    "title": "Day 5 - Healthly Eating",
    "date": "2025-07-16",
    "content": "Working from home today!! </br></br>  I was up early to water the garden, then went for a walk around the big green feild and back before opening another packer of oak cakes for breakfast.  </br></br>The Monkeys didn't leave me much food to make meals with I will have to think about going shopping soon.  </br></br>Else I will be eating Icy poles, chocolate biscuits and crisps every meal this week." 
  },
  {
    "title": "Day 6 - No More Icy Poles",
    "date": "2025-07-17",
    "content": "Another day working from home!! - The weather has cooled down a bit. Which is lucky beacuse I have run out of icy poles now :).   Still not been food shopping yet but still have big bag of the left over snacks to keep me alive.</br></br> I wonder what the Monkeys have been doing in Melbourne I hope they are taking lots of picture and writing in their journals so I get to know all about it. </br></br> Still missing them lots.. the house is very quiet without them. " 
  },
  {
    "title": "Day 7 - One Week Alone",
    "date": "2025-07-18",
    "content": "I've survived a whole week on my own!! </br></br> Still not been food shopping, and I have run out of clean clothes to wear but I am alive. </br></br> I went for a walk in the woods this morning and then worked from home.  I'm stil snacking on the final few snacks mum left me.  Pistachio nuts for breakfast and lunch with some chocolate digestive for snacks in between work phone calls. </br></br> I saw a squirrel and a deer in the garden today, but no Monkeys :( </br></br> I wonder what they are doing today?  </br></br> I hope they are having fun and not missing me too much."
  },
  {
    "title": "Day 8",
    "date": "2025-07-19",
    "content": ""
  },
  {
    "title": "Day 9",
    "date": "2025-07-20",
    "content": ""
  },
  {
    "title": "Day 10",
    "date": "2025-07-21",
    "content": ""
  },
  {
    "title": "Day 11",
    "date": "2025-07-22",
    "content": ""
  },
  {
    "title": "Day 12",
    "date": "2025-07-23",
    "content": ""
  },
  {
    "title": "Day 13",
    "date": "2025-07-24",
    "content": ""
  },
  {
    "title": "Day 14",
    "date": "2025-07-25",
    "content": ""
  },
  {"title": "Day 15",
    "date": "2025-07-26",
    "content": ""
  },
  {"title": "Day 16",
    "date": "2025-07-27",
    "content": ""
  },
  {"title": "Day 17",
    "date": "2025-07-28",
    "content": ""
  },
  {"title": "Day 18",
    "date": "2025-07-29",
    "content": ""
  },
  {"title": "Day 19",
    "date": "2025-07-30",
    "content": ""
  },
  {"title": "Day 20",
    "date": "2025-07-31",
    "content": ""
  },
  {"title": "Day 21",
    "date": "2025-08-01",
    "content": ""
},
  {"title": "Day 22",
    "date": "2025-08-02",
    "content": ""
  },
  {"title": "Day 23",
    "date": "2025-08-03",
    "content": ""
  },
  {"title": "Day 24",
    "date": "2025-08-04",
    "content": ""
  },
  {"title": "Day 25",
    "date": "2025-08-05",
    "content": ""
  },
  {"title": "Day 26",
    "date": "2025-08-06",
    "content": ""
  },
  {"title": "Day 27",
    "date": "2025-08-07",
    "content": ""
  },
  {"title": "Day 28",
    "date": "2025-08-08",
    "content": ""
  },
  {"title": "Day 29",
    "date": "2025-08-09",
    "content": ""
  },
  {"title": "Day 30",
    "date": "2025-08-10",
    "content": ""
  },
  {"title": "Day 31",
    "date": "2025-08-11",
    "content": ""
  },
  {"title": "Day 32",
    "date": "2025-08-12",
    "content": ""
  },
  {"title": "Day 33",
    "date": "2025-08-13",
    "content": ""
  },
  {"title": "Day 34",
    "date": "2025-08-14",
    "content": ""
  },
  {"title": "Day 35",
    "date": "2025-08-15",
    "content": ""
  },
  {"title": "Day 36",
    "date": "2025-08-16",
    "content": ""
  },
  {"title": "Day 37",
    "date": "2025-08-17",
    "content": ""
  },
  {"title": "Day 38",
    "date": "2025-08-18",
    "content": ""
  },
  {"title": "Day 39",
    "date": "2025-08-19",
    "content": ""
  },
  {"title": "Day 40",
    "date": "2025-08-20",
    "content": ""
  },
  {"title": "Day 41",
    "date": "2025-08-21",
    "content": ""
  },
  {"title": "Day 42",
    "date": "2025-08-22",
    "content": ""
  },
  {"title": "Day 43",
    "date": "2025-08-23",
    "content": ""
  },
  {"title": "Day 44",
    "date": "2025-08-24",
    "content": ""
  },
  {"title": "Day 45",
    "date": "2025-08-25",
    "content": ""
  },
  {"title": "Day 46",
    "date": "2025-08-26",
    "content": ""
  }
]

