[
  {    "title": "The Return of the Monkeys",
    "date": "2025-07-10",
    "content": "The Monkeys are off on their big adventure to Australia tomorrow. </br></br> Mum and the Monkeys are flying to Singapore first, then on to Melbourne. </br></br> I will be left at home for 6 weeks all on my own. </br></br> I wonder what adventures they will have? </br></br> I hope they have a great time and take lots of pictures to share with me.</br></br> This is a blog of me counting down the days till the Monkeys Return home to me."
  },
  {    "title": "The Countdown Begins",
    "date": "2025-07-11",
    "content": ""
  },
  {
    "title": "Summer 2025 - The Adventure Begins!!",
    "date": "2025-07-11",
    "content": "I've just dropped off Mum and the Monkeys at the airport. Waved + hugged them goodbye at Airport Security and now my adventure begins!!. </br></br> Will I survive for 6 weeks all on my own?? </br> What sort of adventures will I have? </br></br> I guess we will see..."
  },
  {
    "title": "First Day Without the Monkeys",
    "date": "2025-07-12",
    "content": "Woke up early expecting one of the Monkeys to come in for a cuddle.  Then I reliased I was all on my own :( </br></br> The Monkeys were probably still a few hours away from landing in Singapore. I missed them but they were off on their own adventure. </br></br>I used all my chef skills opening a packet of oat cakes for breakfast, then I went for a walk in Rushmere Woods. </br> </br> I walked up to the balance logs, counting logs, big chair and climbed on the spider before walking home.  </br></br> After that I went into town, did some clouring at the library. It wasn't as much fun doing that on my own, so I went to get my haircut and got a 2x sasuage rolls (1x Black Pudding, 1x Firecracker) and a free coffee. </br></br> With my energy levels recharged, I had the power I needed to water Granny's garden and do a little bit of weeding for her. </br> </br> Now that the green bin was full. Granny rewarded me for doing her gardening she made me a Granny Ham and Mustard Sandwhich. Yummy!! </br></br>  Back home now as have lots of work todo for Monday. I've not made any plans for rest of the weekend.. but who knows what might happen next? "
  },
    {
    "title": "Day 2 - Home Alone",
    "date": "2025-07-13",
    "content": "No cuddles again!! :( </br></br> But I got a message to say the Monkeys were now safe in Austrialia and had checked into their hotel after their long plane trip.  In the message from Mum she said they were all well behaved on the plane.  </br></br>I wonder what the movies and games were like on the plane?  </br></br>They must have been good if the Monkeys were well behaved for the whole trip??  </br></br>I was more adventurous for breakfast today. I didn't have any pastries like we normally do on a Sunday. So, instead I had toast and the left over cheese and chorizo the monkeys left me in the fridge.  I got dressed, I did some work, took the bins out, watched some TV and watered our garden.  </br></br>With the monkeys being away I got to eat the raspberries. They were tasty. I checked out the sunflowers when I watered them. </br></br>Still only one yellow flower, but the other two look like they will flower soon. </br></br>I wonder what colours they will be? </br><br><img src='./images/sunflowers.jpeg' alt='Sunflowers' class='blog-image'>"
  },
  {
    "title": "Day 3 - Back to Work",
    "date": "2025-07-14",
    "content": "I went into London today. I met Gareth on the train. He told me that they had been playing Dojo Island with the Monkeys.  They were impressed that you could do that from the other side of the world.  </br></br> I wonder if the Monkeys did any timestables before playing that???  </br></br>On the weekend they went to Buzzstock Music festival and danced in the Sunshine. Sounded fun, but too hot for me to be dancing about in the Sunshine.  It has been 30 degrees for the last few days. Probably hotter than Austrailia?  Thankfully the office has air conditioning so it was nice and cool sitting at my desk. I had a busy day at work, with lots of long phone calls :( but it was someone's birthday and they brought in chocolate cake for us to share. So that was a nice treat. </br> </br>Afterwork I went to Granny's for my dinner. She cooked me pasta with pesto and I had some of Scott's ice cream.  </br></br>I wonder what my Monkeys have been doing in Austraila?? </br></br> Have they had any Austrailia food yet to tell me about?"
  },
  {
    "title": "Day 4 - Train Delays",
    "date": "2025-07-15",
    "content": "In London again today, didn't meet anyone interesting on the train but we did get stuck behind a slow train. So we were late getting into the station.  At the station there was a man giving out free samples of sweets.  They looked like maltesers but had a chewing middle.  I prefer malteasers.  </br></br>Nothing much going on at work today so I spent some time improving the Maths robot so that the Monkeys can practice while they are away. I am a bit worried that they might actually start to beat me soon. </br></br> I miss them :( </br></br> I can't wait to hear about their adventures in Oz."
  },
  {
    "title": "Day 5 - Healthly Eating",
    "date": "2025-07-16",
    "content": "Working from home today!! </br></br>  I was up early to water the garden, then went for a walk around the big green feild and back before opening another packer of oat cakes for breakfast.  </br></br>The Monkeys didn't leave me much food to make meals with. I will have to think about going shopping soon.  </br></br>Else I will be eating Icy poles, chocolate biscuits and crisps every meal this week." 
  },
  {
    "title": "Day 6 - No More Icy Poles",
    "date": "2025-07-17",
    "content": "Another day working from home!! - The weather has cooled down a bit. Which is lucky beacuse I have run out of icy poles now :).   Still not been food shopping yet but still have big bag of the left over snacks to keep me alive.</br></br> I wonder what the Monkeys have been doing in Melbourne I hope they are taking lots of pictures and writing in their journals so I will get to read all about it. </br></br> Still missing them lots.. </br></br>The house is very quiet without them so Granny made me these to keep me company </br></br> <table class='blog-table-center'><tr><td><img src='./images/cindy1.png' alt='Riches' class='blog-image'></td><td><img src='./images/cindy2.png' alt='Rags' class='blog-image'></td></tr></table>" 
  },
  {
    "title": "Day 7 - One Week Alone",
    "date": "2025-07-18",
    "content": "I've survived a whole week on my own!! </br></br> Still not been food shopping, and I have run out of clean clothes to wear but I am alive. </br></br> I went for a walk in the woods this morning and then worked from home.  I'm stil snacking on the final few bits the Monkeys left me.  Pistachio nuts for breakfast and lunch with some chocolate digestive for snacks in between work phone calls. </br></br> I saw a squirrel and a deer in the garden today, but no Monkeys :( </br></br> I wonder what they are doing today?  </br></br> I hope they are having fun and not missing me too much."
  },
  {
    "title": "Day 8 - Washing Day",
    "date": "2025-07-19",
    "content": "Up early for walk in the woods. Did the Heath and Reach circuit I normally do with Mum. Althought I didn't run up the hill to get to the big chair.  Walked back home and drove over to Granny's for breakfast and to do the washing.  </br></br><img src='./images/washing.jpeg' alt='Me washing' class='blog-image'></br></br>I cooked bacon and Daddy eggs while the washing machine did it's thing.  Then hung the clothes out on the washing line to dry. </br></br> I had a nice chat with Granny while I was there, she said she was missing the Monkeys too. </br></br> After that I went to the shops and bought some food for the week.  I got some bread, ham, cheese and a couple of beers.  </br></br> I also bought some ice cream to treat myself for surviving a week on my own. </br></br> Now I am back home and ready to relax for the rest of the day. </br> </br> I wonder how many ice creams the Monkeys have had while they are on holiday?<img src='./images/icecream.webp' alt='IceCream' class='blog-image'>"
  },
  {
    "title": "Day 9 - Sunday Sleepover",
    "date": "2025-07-20",
    "content": "Had a sleepover at Granny's last night. I cooked her a stir fry for dinner.  So this morning ahe made me some breakfast.  Special Square Sausage that Doglas and Mvairi brought with them last time they were down.  </br></br> It is raining here today.  The rain is probably a good thing as the garden needed it.  There is still only one flower out on the sunflowers. But they all seems to be getting taller still so they will enjoy a big drink.  </br></br>The Monkeys called me today all the way from Austrailia. Sounds like they are having fun. Stories about plane, movies, swimming, footy matches, ice skating and meeting lots of the family. </br></br>They are off to explore Nanna's home and the town she lives in this week I can't wait to find out what they get up to there."
  },
  {
    "title": "Day 10 - Week 2",
    "date": "2025-07-21",
    "content": "Raining again today. But that is ok as it means I've not got any watering to do 😎.</br></br>In London today. It was really empty in the office today. I guess lots of people chose to stay at home with the rain. As it was so quiet I got lots done in the office and left a bit early. Got home early so went to the shops and got a Vindaloo curry for dinner + a beer.  Then after my nice dinner I played Mario Kart. </br></br> <img src='./images/Mario_in_Mario_Kart_World.webp' alt='Mario Kart' class='blog-image'></br>I wonder if the Monkeys are playing any games in Austrailia?</br></br>I am looking forward to hearing all about their adventures when they get back."
  },
  {
    "title": "Day 11 - Working From Home",
    "date": "2025-07-22",
    "content": "I decided to work from home today as I had a work party to go to later in the week.</br></br>I was up earlier-ish and watched Newsround while drinking my coffee. It is a good show.. but less fun on your own ☹️.</br></br>Bit of dull day today. I worked on the computer, had lots of boring phone calls and not much else. As I'd run out of snacks I went for a walk to the Co-Op and got some supplies to keep me going.</br></br>Hopefully they will give me the energy to get some faster times on Mario Kart tonight!!<img src='./images/laptop.png' alt='Laptop' class='blog-image'>"
  },
  {
    "title": "Day 12 - Tennis Party",
    "date": "2025-07-23",
    "content": "After a late night trying (and failing) to beat the top times on Mario Kart I dragged myself out of bed and headed into London again today.</br></br>A lot of people were in today as there was a party after work!</br></br>We went to the Courthouse Hotel in Old Street.  There was a rooftop party with a tennis theme.🎾</br></br> Apparently we were meant to have the week of the Wimbledon Final but so many people wanted to go to the party they had to change the date and find a larger venue.</br><br>It was a cool place and the weather was just right to be outside in the evening. They had an awseome BBQ with loads of nice food to try.</br></br><img src='./images/guess.jpeg' alt='balls' class='blog-image'></br></br>It was a fun night.. but getting home was not fun...</br></br>I got stuck on a train. It just stopped at a station for 40 mins.  Not sure why the train stopped but when we got a green light to progress I finally made it back to Granny's house.</br></br>I am glad she lives near the station and was ok with me sleeping over.</br></br>I got some cool treats for the Monekeys too. </br></br>(well if you like tennis it is a cool present 🎾 🎾 🎾). <table class='blog-table-center'><tr><td><img src='./images/ukflag.jpeg' alt='view from rooftop' class='blog-image'></td><td><img src='./images/okview.jpeg' alt='Picture of the view' class='blog-image'></td></tr></table>I thought I would share some random pictures of the view so you could see what you were missing!!"
  },
  {
    "title": "Day 13 - Lazy Day",
    "date": "2025-07-24",
    "content": "I was super tired today after the long train ride home. Thankfully I didn't have to go anywhere today.  I worked from home and as everyone had been at the same party the night before I guess they were all tired as it was a quiet day and I will be going bed super earlier tonight.<img src='./images/sleepy.jpeg' alt='Sleepy' class='blog-image'>"
  },
  {
    "title": "Day 14 - Home Alone 2",
    "date": "2025-07-25",
    "content": "I got up early today.  Did some watering of the garden.  I still can't belive that there are no flowers on the other two Sunflowers yet.  I wonder when they will come?</br></br><img src='./images/stillnoflower.jpeg' alt='Picture of a Sunflower which has not opened yet' class='blog-image'>I've been invited to a BBQ this weekend at Ollie and Orla's house.  Nice of them to invite me.</br></br>I wonder if the Monkeys have had any BBQ, or any other nice food in Austraila?</br></br><img  src='./images/bbq.jpeg' alt='BBQ' class='blog-image'></br></br> I am looking forward to hearing all about their adventures when they get back."
  },
  {"title": "Day 15 - The Naughty Squirrel",
    "date": "2025-07-26",
    "content": "I woke up early thinking it was Olly and Oral's BBQ. I stayed at Granny's so I could get an early start on what I thought was going to be a busy day. </br></br> I made two big breakfast rolls of Daddy eggs, Bacon, Black Pudding and Marmite.  They we great and gave me the power to go out an cut Granny's grass.  Just as I was about the start the phone rang.☎️  </br></br>It was the Monkeys calling for their Saturday chat with Granny.  Sounds like they were having lots of fun.  Each of the Monkeys had so much to tell us about their adventures. </br></br>Kangaroos, tractor and motorbike rides, swimming and minecraft there was so much going on!!! </br></br>  Granny said she was worn out after the phone call listening to all the fun they were having.  She was very impressed with the grown up conversation each of the Monekys was capable of.  (Well done Monkeys!! - it is great to hear people recognising and praising your conversation skills and phone manners.) </br></br> The grass wasn't too long so was quick to cut.  It looks tidy now and is ready for Granny's visitors arriving later today.  Mvari and Douglas are coming to stay for a few days. Sounds like they have a few trips planned with Granny so she should have some stories next time the Monkeys call her.  </br></br> With grass cut I headed to the shops to get some bits for the BBQ.  I was all stocked up and ready to go to the BBQ when I realised that I had got the dates mixed up.  The BBQ was tomorrow!! Silly Dad!! I clearly was missing the Monkeys + Mum and her orgnaisational skills :) </br></br> So I had a spare day to myself and lots of snacks.  I decided to go home and so some of my own gardening.  It was then I discovered that the squirrel had been <b><u>really</u> <u>really</u></b> naughty!!   </br></br><table class='blog-table-center'><tr><td><img src='./images/naughty0.jpeg' alt='Damage caused by the naughty squirrel' class='blog-image'></td><td><img src='./images/naughty3.jpeg' alt='Damage caused by the naughty squirrel' class='blog-image'></td></tr><tr><td><img src='./images/naughty2.jpeg' alt='Damage caused by the naughty squirrel' class='blog-image'></td><td><img src='./images/naughty.jpeg' alt='Damage caused by the naughty squirrel' class='blog-image'></td></tr></table></br></br>He had been eating the Sunflowers for their seeds!! Either that or he has decided who is going to win the Sunflower growning competition ;) </br></br>What a naughty squirrel!!</br></br> <img src='./images/winneris.jpeg' alt='Still no flower' class='blog-image'></br></br> Still no flower on the tallest one.  I think it will be Orange. But I will have to find a way to keep the Squirrel away??"
  },
  {"title": "Day 16 - A Bouncy Castle",
    "date": "2025-07-27",
    "content": "It really was Olly and Oral's BBQ today!! :) </br></br>I got up early and walked into town to get my free coffee. I stopped in to see Granny and her visitors.  Then I walked home, had a shower and got ready for the BBQ. </br></br> I went over to Olly and Oral's house and they had a bouncy castle in the garden!!</br></br>It was so much fun bouncing about on it before the children kicked me off.  Apparently it was the children only and not the grown ups. ☹️  </br></br>They had lots of nice food too, burgers, sausages, chicken and lots of cakes and ice cream. </br></br>It was a great day watching England win the European Football Final and I got to see lots of the Monkey's friends from school.</br></br><table class='blog-table-center'><tr><td><img src='./images/bouncycastle.jpeg' alt='Bouncy Castle' class='blog-image'></td><td><img src='./images/eurocup.jpeg' alt='european cup winners 2025' class='blog-image' /></td></tr></table></br></br>Everyone asked how the Monkeys were getting on in Oz, and all were looking forward to seeing you, and hearing about your adventures when you get back.</br></br>Not long to go now.. only a few weeks holiday left!! "
  },
  {"title": "Day 17 - Monday Morning",
    "date": "2025-07-28",
    "content": "I didn't stay too late at the BBQ so I was wide awake and ready to go.</br></br>I popped in early to see Granny and her visitors. They were going to a flower show. But I had to go to work.</br></br>It was a nice day in the office today there were a few more people in to chat to than last Monday.  It was good to be able to tell them all about my Monkey's adventures.</br></br>Everyone in the office was jealous of all the fun you were having on the otherside of the world.</br></br> 🙊 🇦🇺 🌏"
  },
  {"title": "Day 18 - Green Bin Day",
    "date": "2025-07-29",
    "content": "I decided to work from home today as I wanted to finish of some of the gardening I had started on the weekend. </br></br>I wanted to try to fill the Green Bin before it was taken away by the Bin Men.</br></br><img src='./images/greenbin.jpeg' alt='Green Bin' class='blog-image'></br></br>I cut the grass and trimmed a few things on Saturday but still had the grass at the front and top to cut and lots of weeds to pull out.  I cut the grass on my lunch break and did a little bit of weeding.</br></br>Mum's experiement is working. I found a flower on her Hydrangea today.</br></br><img src='./images/mumsplant.jpeg' alt='Picture of Hydrangea' class='blog-image'> Then I chilled out on the sofa in front of the TV for a bit.  The house is so quiet with no Monkeys stomping, shouting or playing. </br></br> I miss them lots ☹️.</br></br> I wonder what they are doing today?  </br></br> I hope they are having fun and taking lots of pictures, and writing their jornals to share their with me when they get back.</br></br>I wonder if the Monkeys have been doing any gardening/farming in Austrailia?"
  },
  {"title": "Day 19 - Hard Work",
    "date": "2025-07-30",
    "content": "It was hard work getting out of bed this morning!</br></br> I was tired after the gardening and I fell asleep on the sofa so didn't sleep well 🥱.</br></br> The Bin Man came early. I hope he was happy with the full bin I left out for him.</br></br> I worked, went the shops for lunch, and worked a bit more.</br></br> Garden looks good but a pretty non eventful day.</br></br>I hope the Monkeys are having more fun than I did today.</br></br> I wonder what they have on their itinery today?"
  },
  {"title": "Day 20 - London Calling",
    "date": "2025-07-31",
    "content": "In the city today. I like Thursdays as my friend Johan is normally in.</br></br>He is from South Africa so has a different view on the world to me. I like chatting with him and he knows lots about the work as he has been doing my job for 14 years so is great person to bounce ideas off of.</br></br>It was a good day. A busy day.  But I got lots done. I left early-ish, the trains were on time and Granny cooked me a steak dinner. I even had ice-cream for dessert. </br></br><img  src='./images/ice-cream-yummy.jpg' alt='Yummy' class='blog-image'></br></br>Yummy!!!"
  },
  {"title": "Day 21 - TGI Friday",
    "date": "2025-08-01",
    "content": "I was famished. I sprung out of bed. Threw on some clothes and ventured out to procure some essential for the supermarket. </br></br> I went to Waitrose as I wanted to get the nice hummous and some olive bread. I wasn't really in a rush but I hurried around the supermarket aisle grabbing a few extra nice snacks to keep me going. </br></br> After paying at the checkout I went and picked up my free coffee from Cafe Nero.  I like having vouchers for things. Even though I probably spent more on my shopping at Waitrose the free coffee made it feel ok as I would never pay £4 for a coffee normally. </br></br> I jumped back in the car and headed home to enjoy my breakfast.  After my bread and Martmite I jumped in the shower and got ready for work. </br></br> Lots of calls today, but it was an OK day. </br></br> I am working on a project with a couple of new joiners.  They are really smart, and know all about application coding but are still learning about how their code works on the computer systems we use.  Working with them is a great way for me keep my knowledge up to date as I have to explain how it works, and I get to learn a few new things from them. </br></br> I had a Steak and Stilon pie for lunch, and snacked on popcorn and some chocolate to keep me going to dinner time. </br></br> <img src='./images/moopie.webp' alt='My Pie' class='blog-image' /> </br></br>It felt like a busy day today.  </br></br> No plans tonight.. but still early as I write this and still nice and sunny so maybe I should go for a walk. </br></br> Will tell you tomorrow..."
},
  {"title": "Day 22 - Cheery Beer",
    "date": "2025-08-02",
    "content": "I didn't go for a walk last night so I did this morning. </br></br> Up resonably early and still had some nice bread and snacks from shops so I did a lap of rushmere and then back home for breakfast. </br></br> After that I had a bit of a lazy day. I did a little bit of work on the compueter, a little bit of tidying up but not a lot else. </br></br> After a little bit of watching TV I went to tesco to get something for dinner.  I got some Tandori chicken which was on special and found some Gunpowder potatoes. With my main course planned I walked by the beers just to see if they had anything to go with it.  They had a 4 for 3 deal on so I picked two I like and a couple of new ones.  I picked one which was Cherry flavoured. 🍒</br></br> Probably not something that went with my Indian main course but I thought it might be a nice dessert alternative. </br></br> It was... dinner was good but as I type this up I am enjoying my Cheery Beer and watching TV. There was a Transformer movie on earlier on, but I didn't watch it.. I figure there will be a lot of Transformers happening whrn the Monkeys come home. </br></br> Only 21 days to go now!! </br></br> Can't wait to see them all again!!!"
  },
  {"title": "Day 23 - Big Breakfast ",
    "date": "2025-08-03",
    "content": "Up early again today.  Cooked Bacon and Black Pudding rolls for breakfast and went for a short walk. Only up around the green field but did it pretty quickly to wake me up. </br></br>I had some paperwork things to today for meeting with accountant this week. So got all that done and emailed out and then I went up to Bletchley to look at the shops. I've been invited out by the UK boss on Wednesday night. Not just me there will be about 10 of us going out for dinner and drinks.  I've got a new T-Shirt now so I'll look pretty. </br></br> At Granny's now for dinner as I'm off to London tomorrow.  She has a sore leg at the momemnt so she is not very happy and has had to go an see the Doctor a few times for medicine. </br></br>I hope the Monkeys are all well and having fun. Not spoken to them for a few days so will probbaly call them in the morning to see what they have bneen up to.  "
  },
  {"title": "Day 24 - Nothing Exciting",
    "date": "2025-08-04",
    "content": "Up late... but as I was at Granny's house it was not a problem.  Got my normal train in and met Graeth on the train so I had someone to chat with which was nice. </br></br> It was an ok day at work today.. nothing very exciting to report but it was a lot less busy than Friday. So headed home earlyish, emptied out the bins at Granny's and ours, watched some TV and went to bed early. The house is so quiet with no Monkeys around, but very tidy!! 😀"
  },
  {"title": "Day 25 - Home Alone 3",
    "date": "2025-08-05",
    "content": "Working at home isn't as much fun when there is no one else there. With no Monkeys around there isn't any drama in the mornings... Nobody fights with their socks and shoes, there is a no naughty/knotty hair to casue trouble and the toast always has a little bit of butter and lots of Daddy Marmite on it and nobody complains. So I just get up, eat my toasy, get dressed and brsh my hair without any fighting. But then I do just sit on the computer and phone all day.  "
  },
  {"title": "Day 26 - Dinner With The Boss",
    "date": "2025-08-06",
    "content": "In London again today. Pretty standard day at work with lots of boring phone calls but tonight we had a dinner with the head of the department I work for along with some other recent new joiners to the company. </br></br> We went to a bar near the office for a couple of drinks then to a resturant for food. I had a nice steak with sweet potatoe fries, mushrooms and some spinach. Yummy!! </br></br> It was nice to meet some more people I work with, and the boss seems really nice so good to meet her.  They were all talking about the bring your children to work day planned for end of Aug, and how they didn't think much work would get done if wall the Children were in the office. I need to tell them if my Monkeys want to go before the 8th Aug. So not long to let me know!! </br></br>  I didn't stay long after dinner decided to be sensible and try to catch last fast train home and check in on Granny. Think her leg is getting a bit better but she is having to see the Doctor again this week to check up on her."
  },
  {"title": "Day 27 - Lay in",
    "date": "2025-08-07",
    "content": "I didn't need to go in to London again this week and I had stayed with Granny as her house is near the station. So decided to worked from her house. </br></br> When I got up I made a coffee and watered Granny's garden. She had some more strawberries growing!!  And is finally getting a few more runner beans.  So that cheered her up.  I had dinner at Granny's and went home to check in on our garnden.  Still no flower on the remaining Sunflower, and no more strawberries or raspberries.  The grass has just about recovered from the heatwave we had I'll probably have to think about another cut before the Monkeys get back."
  },
  {"title": "Day 28 - Happy Birthday",
    "date": "2025-08-08",
    "content": "<img src='./images/cake.webp' alt='Cake' class='blog-image'> </br></br> It's Mummy Monkeys Birthday today.  <b>Happy Birthday!!!</b> </br></br> The Monkeys told me they had a nice gift for you and had been working on making cards with Nanna.  Sure they looked after you and were well behaved for the whole day. </br></br> Hope you had a fun birthday back home with your family!!! </br></br>Missing you!!! 💋❤️😘"
  },
  {"title": "Day 29 - Saturday",
    "date": "2025-08-09",
    "content": "Up early for a walk.  Wizzed around Rushmere and home again. </br></br> Only two weeks to go and the Monkeys will be home.  It will be nice to have someone to go for walks with again!! </br></br>Then I went to Granny's watered her Garden and I walked to town to get a haricut so I keep looking pretty. On the way back I picked up my free coffee, and popped into the shops to get Granny a few bits. I cut her grass and then home to cut our grass and do some more bits in the Garden.  Felt like a long day today. Hopefully my Monkey helpers will be home soon to help me in the garden. </br></br> There is still no flower on the remaining sunflower!?!? </br></br> <table class='blog-table-center'><tr><td><img src='./images/almostthere.jpeg' alt='Almost there' class='blog-image'></td><td><img src='./images/almostthere2.jpeg' alt='Sunflowers' class='blog-image' /></td></tr></table></br></br>"
  },
  {"title": "Day 30 - Uncle Sam's Birthday",
    "date": "2025-08-10",
    "content": "<img src='./images/cake.webp' alt='Cake' class='blog-image'> </br></br><b>Happy Birthday Uncle Sam!!</b> </br></br> He clearly already has had the best present as the Monkeys went to visit him a few days ago.  Sounded like a fun day playing with cousins and learning about Aussie Rules football. (Mum sent me some good pictures) </br></br> I had a really boring day today.. short walk in the morning and walked to Tesco at lunchtime but sat on the computer all day doing work for Monday. As I have to finish a project write up this weekend to talk over with people in the office on Monday. "
  },
  {"title": "Day 31 - Big Presentation",
    "date": "2025-08-11",
    "content": "Got the train in with Gareth again today.  He was asking what the Monkeys were up to and wants to know more about Aussie Rules Football when you get back. </br></br> Presentation went ok with all the work I did Sunday getting discussed. Hopefully next time will be easier as I can reuse bits of the presentation for other projects. </br></br> I had confirmation about 29th of Aug places for my two biggest Monkeys so I'm looking forward to showing them around the office and getting them to do all my work for me that day."
  },
  {"title": "Day 32 - An Odd Day",
    "date": "2025-08-12",
    "content": "It was a bit of an odd day today. I woke up early so decided to go into work on a earlier train. </br></br> But when I got to the sation all the ticket machines were broken!!</br></br>  Due to the faulty machines I had to buy my ticket on the train. This was fun because lots of people had to do the same so the conductor was busy and I couldn't get my normal ticket :(  So as I was early I decided walked to work from Euston. </br></br> This all worked out well, as it was a nice day for a walk and as I was early I arrived at about the same time as I normally do when I catch the tube and when I got to the office I was just in time for the breakfast they do on a Tuesday.  I had bacon and cheese crossiants and they had some Monster Munch in the snack cupboard. So I grabbed a bag of pickled onion for later on. </br></br> I had gone into the office today especially for a meeting with someone, but when I turned on my computer I got a mesaage that they were not able to come in. Which was sad news as I like working from home on a Tuesday but it actually worked out quite well for me.  As instead of a long meeting I had some quiet time and enjoyed my Monster Munch.  </br></br> <img src='./images/monstermunch.jpeg' alt='monster munch' class='blog-image' /> </br></br> I walked back to the station, got my train home to see Granny and do her bins. She surprised me with a beef stir fry which was nice as I was hungry and I wasn't expecting it.  Then back home to do our bins and then off to bed as I was tired."
  },
  {"title": "Day 33 - Early Start",
    "date": "2025-08-13",
    "content": "After my surprise dinner from granny I decided to get up and go for a early morning walk.  Nipped up to Rushmere and back to get a shower and dressed rerady for work. </br></br> It is warming up again after a few days of cooler weather. Thankfully I have a few more cornettos to get me through the hot weather 😀🍦. </br></br> <img src='./images/cone.jpeg' alt='cornetto' class='blog-image' /> </br></br> Popped in to see Granny and take her bins in and that was the most exciting things I did today. </br></br> Can't wait for my Monkeys to come back things are way less boring when they are here!!"
  },
  {"title": "Day 34 - Nice Surprise",
    "date": "2025-08-14",
    "content": "I was going to work from home anyway.. but it was raining when I woke up so I knew I made a good choice. It was a busy day of phone calls I had an M&S Vindaloo curry and rice with a mint cornetto for pudding. Yummy!! </br></br> Had a nice surprise flower spring up in the kitchen. Looks pretty and know my Monkeys would approve of the colour. <img src='./images/surprise.jpeg' alt='Surprise' class='blog-image' />"
  },
  {"title": "Day 35 - Exciting News!!",
    "date": "2025-08-15",
    "content": "Only one week to go now and the Monkeys will be on their way home. It will be good to see them again. But oh so noisey!! So that could be a shock to the system after the holiday. </br></br>I had a good chat with them on the phone this week. They sounded like they were having fun but also starting to miss home (and maybe me?) a little bit.  But they still have lots of exciting things planned in the final days away. Can't wait to hear all about them when they get back. </br></br>I've got some news for them!! The flower opened!!</br> <table class='blog-table-center'><tr><td> <img src='./images/finally.jpeg' alt='Yellow' class='blog-image' /> </td><td> <img src='./images/finally2.jpeg' alt='Yellow' class='blog-image' /></td></tr><tr><td colspan=2><img src='./images/finally3.jpeg' alt='Yellow' class='blog-image' /> </td></tr><tr><td><b>Who guessed Yellow?</b></td><td><b>And 10ft tall?</b></td></tr></table>"
  },
  {"title": "Day 36 - Tidy up begins",
    "date": "2025-08-16",
    "content": "This weekend I thought I had better start getting ready for the return of the Monkeys. I'd already washed all there school uniforms ready for the new term!! (Yes they have to go back to school) so just needed to take all the drying clothes and put them in their rooms, and tidy up a few bits of mine. I guess I will have to start tudying up my control center too :( <img src='./images/controlroom.jpeg' alt='control-room' class='blog-image' />"
  },
  {"title": "Day 37 - Sunday Funday",
    "date": "2025-08-17",
    "content": "My last Sunday without the Monkeys.  I thought about staying in bed for a lay in but I got up as still had some tidying to do. </br></br>I went for a walk before lunch.  I walked up to the green field, then up the big hill to Rushmere, round past the fairy chairs, up past the spider (who says he is missing you guys) and when I got to the BIG Chair I was shocked to see someone has broken one of the arms off of it!! ☹️ <table class='blog-table-center'><tr><td><img src='./images/brokenbigchair.jpeg' alt='big-chair' class='blog-image' /></td><td><img src='./images/spider.jpeg' alt='spider' class='blog-image' /></td></tr></table>I had a few left over bits for lunch and then spent the afternoon tidying a few bits in the garden. The sunflower is still looking good, and I have some good news about the sunflower which had its head cut off. It looks like there are 3 flower buds growing on the top leaves so hopefully the Monkeys will get to see them open when they are back. Maybe these will be a different colour???<table class='blog-table-center'><tr><td>  <img src='./images/lookinggood.jpeg' alt='sunflower' class='blog-image' /> </td><td><img src='./images/buds.jpeg' alt='more flowers' class='blog-image' /> </td></tr></table>I'm off to London tomorrow so staying with Granny tonight. I'm writing this from her kitchen table.  Granny is cooking me my dinner tonight we are having chicken stir fry.  And for pudding hopefully there is some chocolate ice cream!! Yummy!!"
  },
  {"title": "Day 38 - End of Summer",
    "date": "2025-08-18",
    "content": "The office has been pretty quiet over the summer holiday with lots of people either working from home or going away with their kids.  You can tell that the holiday season is coming to an end as the office was busier than it has been for sometime. I had loads of work todo today, lots of documents to edit and jobs to complete before my boss comes back from her holidays tomorrow. "
  },
  {"title": "Day 39 - The Boss is Back",
    "date": "2025-08-19",
    "content": "I wasn't looking forward to my boss coming back as I have enjoyed the last few weeks at work managing myself. However it wasn't too bad... I thought she would have lots of work to dish out from her email inbox but that wasn't the case.  We had a catch up and think she is ok with what I've done while she was away. Sure there will be more to come later in the week but it wasn't as bad as I thought it was going to be."
  },
  {"title": "Day 40 - How do you like them Apples?",
    "date": "2025-08-20",
    "content": "Worked from home today.  I had a few things to get done, but nothing to exciting to tell you about work.  When I was watering the garden I noticed the apple tree looks like it has some good apples growing on it.  Some of them are almost as big as the ones you get in the shops. Hopefully the naughty squirrel will not get to them before the Monkeys are back to eat them.  <table class='blog-table-center'><tr><td><img src='./images/apples2.jpeg' alt='Apple Tree' class='blog-image' /></td><td><img src='./images/apples1.jpeg' alt='Apples' class='blog-image' /></td></tr></table>"
  },
  {"title": "Day 41 - Be Cool",
    "date": "2025-08-21",
    "content": "Up early so went for a walk. The weather has been nice this week its cooled down but is still nice and sunny. Hopefully the next walk I do the Monkeys will be with me, the woods is much more fun with them. </br></br> Pretty busy day of phone calls today. Clearly more people back from holiday trying to get back to work as we rehash things discussed weeks ago. </br></br> Finished early and cooked a pie for dinner. I chilled on the sofa, watched some TV and went to bed early."
  },
  {"title": "Day 42 - Friday - Blast off",
    "date": "2025-08-22",
    "content": "The countdown has started.. the monkeys will be getting on a plane today and flying home. I'm super excited to see them start their journey home."
  },
  {"title": "Day 43 - Up in the Air!!",
    "date": "2025-08-23",
    "content": "The Monkeys are flying back right now. Hopefully they are being good on the plane.  Sounded like they enjoyed all the films and games on the way over. So fingers crossed they enjoy it on the way back. </br></br> I think the house is ready for them, I just need to go to the shops later on to make sure there is lots of food in the cupboards for when the get back."
  },
  {"title": "Day 44 - They are back!",
    "date": "2025-08-24",
    "content": "Up early and jumped in the car. Nice and easy driving early on a Sunday morning. Was super exciting to see them all and get kisses and cuddles again. </br></br>They had so many stories to tell me about things they had seen and done. The car ride home felt so quick with all their stories and excitement. "
  },
  {"title": "Day 45 - Home Again",
    "date": "2025-08-25",
    "content": "I normally like to work from London on a Monday but I decided to work from home to spend some time with the Monkeys. They were either going to sleep all day or be awake at funny times so figured I would stay home and see how they all felt after their travels as it would probably take them a few days to adjust to UK time."
  },
  {"title": "Day 46 - When are they going away again?",
    "date": "2025-08-26",
    "content": "Only kidding!! - Super happy they are home!!"
  }
]

